Autodesk.Revit.DB.Structure.RebarConstraintsManager.GetRebar
Gets the Rebar element whose constraints are managed using this instance.
Returns:
Returns the Rebar element whose constraints are managed using this instance.
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstraintsManager.AllowConstraintTargets(Autodesk.Revit.DB.Structure.RebarConstrainedHandle,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Returns true if references are valid targets for handle, false otherwise.
Remarks:
For a free form rebar valid targets are one or more references to faces or edges of elements that can host rebar.
If the handle accepts constraints to edges, the references should be edges of elements that can host rebar.
If the handle does not accept constraints to edges, the references should be faces of elements that can host rebar.
For a shape driven rebar this function will always return false. RebarConstraintsManager.GetConstraintCandidatesForHandle() can be used to obtain possible constraints.
handle:
Represents the constrainable rebar handle.
targetsToConstrain:
Represent the refernces to be checked as valid targets for handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The RebarConstraintsManager does not manage a valid Rebar element.
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstraintsManager.ClearHandleConstraintPairHighlighting(Autodesk.Revit.DB.Document)
Clears all highlighting in all views.
Remarks:
If highlightHandleConstraintPairInAllViews has been called, then this method can
be used to remove all highlighting.
document:
The document in which the highlighting will be cleared.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraintsManager.HighlightHandleConstraintPairInAllViews(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarConstrainedHandle,Autodesk.Revit.DB.Structure.RebarConstraint)
Highlights the specified RebarConstrainedHandle and RebarConstraint in all views.
Remarks:
This method is provided as a way to help end users visualize more easily the effect
that selecting new RebarConstraints for the Rebar element's RebarConstrainedHandle
will have on the Rebar. It is purely for graphical output, and does not assume any
relationship between the RebarConstrainedHandle and the RebarConstraint. The caller
is responsible for updating (or clearing) the highlighting in response to changes
in the Rebar's constraints.
Repeated calls to this method are not cumulative; highlighting from previous calls
will be cleared before new highlighting is applied.
document:
The document in which the highlighting will be applied.
handle:
The RebarConstrainedHandle to be highlighted in all views.
constraint:
The RebarConstraint to be highlighted in all views.
Throws Autodesk.Revit.Exceptions.ArgumentException:
constraint is no longer valid.
-or-
handle is no longer valid.
-or-
The handle should have the default behavior.
-or-
The constraint should be for handle with default behavior.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The RebarConstraintsManager does not manage a valid Rebar element.
-or-
The RebarConstraintsManager does not manage a shape driven Rebar element.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraintsManager.IsRebarConstrainedPlacementEnabled
A static property defining that the 'Rebar Constrained Placement' setting is on or off in current Revit Application Session.
Remarks:
The 'Rebar Constrained Placement' functionality was removed from Revit 2027. Similar functionality can be achieved using by setting
constraints to another rebar.
This property will always return false.
Setting this property to true will have no effect.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraintsManager
A class used to obtain information about the constraints (RebarConstraint) acting
on the shape handles (RebarConstrainedHandle) of a Rebar element, and modify the constraints.
Remarks:
A RebarConstraintsManager is created by calling Rebar.GetRebarConstraintsManager(),
and can only be used to query or change constraints on the rebar element that
created it.
The constraint manager has different behavior, depending on the type of Rebar that created it:
Shape Driven or FreeForm
-----ShapeDriven-----
If the Rebar is Shape Driven, Revit uses the following logic to choose automatic constraints
for each handle on a rebar element. First, a search is performed to find all suitable target
planes, including surfaces of the rebar's host, as well as surfaces on other
concrete host elements that are attached to the rebar's host. In the case of
standard style rebar, any host surface occupied by a stirrup will be ignored,
and instead, the handles on the stirrup itself will be treated as candidates
to form a constraint.
Once all the constraint target candidates have been determined, the following
sequence is used to select a constraint target:
If the rebar is a straight standard bar, it will search the list of candidates
for stirrup bends to lock its RebarPlane and Edge handles. If a bend is found within
tolerance distance, then the bar will be snapped and constrained to that bend.The bar will snap and constrain its handle to any host cover or stirrup handle
that lies within tolerance distance.If no candidate is found within tolerance, then the bar will choose nearest
host surface target, with or without cover, and create an automatic constant distance
constraint to that surface.
Snapping tolerances are 0.5 * bar diameter for host surface cover constraints and
0.5 * (bar diameter + stirrup bar diameter) for stirrup handle constraints.
The RebarConstraintsManager allows the API developer to obtain the constraint
candidates for each constrained handle on a rebar, and to override the default
target selection logic by setting a particular constraint as preferred.
The API developer will be able to choose an automatic constraint, or can get
constraint candidates to any host in the model or to any Rebar in the model no matter
what style it is (Standard or Stirrup). There can be set constraints to generic surfaces as well.
This can be useful in a number of ways. First, it can be used to snap a handle to a
particular host surface or stirrup rebar handle, or to position a handle at a
precise distance from a host surface. Second, it can force a rebar handle to
constrain itself to a particular target surface, even if other targets are closer
(or will become closer in subsequent updates of the Revit model). For example,
a bar can be constrained to maintain a constant offset distance from a face of
an opening in a slab, even if the opening is placed close to the edge of the slab
and the bar would normally constrain itself to the slab edge. Lastly, the override
can be used to cancel the default standard bar preference for stirrup bar handle
planes, and to allow standard bars to be constrained to host cover surfaces, even
when a stirrup is present.
----- FreeForm -----
If the rebar is FreeForm, then it requires input constraints that will be consumed to
obtain the actual shape of the bar. The calculation method of the constraints passed
to the rebar is custom made by an API application - Autodesk::Revit::DB::Structure::IRebarUpdateServer.
The RebarConstraintsManager can return all the possible "shape" handles
and can set constraints created only with one of those handles.
There are only active constraints on a FreeForm bar, the current and preferred notions
represent the same thing.
Since:
2014